### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.onp_cluster_resources.kubernetes_namespace.onp_synology_csi will be created
+   resource "kubernetes_namespace" "onp_synology_csi" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "synology-csi"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.onp_cluster_resources.kubernetes_secret.onp_synology_csi will be created
+   resource "kubernetes_secret" "onp_synology_csi" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "client-info-secret"
+           namespace        = "synology-csi"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>